Revit 2024 API
ConicalSurface.HalfAngle Property
 Cone angle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double HalfAngle { get; }
Visual Basic
Public ReadOnly Property HalfAngle As Double
	Get
Visual C++
public:
property double HalfAngle {
	double get ();
}
See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace